Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LTDC/ltdc.c

/**
 * @file ltdc.c
 * @brief Minimal LTDC (RGB interface) driver for STM32F429I Discovery
 * @details Pure LTDC (RGB) logic: display init, layer management, framebuffer, minimal pixel drawing. No SPI/ILI9341 or non-LTDC code.
 */

/* Includes ------------------------------------------------------------------*/
#include "ltdc.h"
#include <stdlib.h>
#include <string.h>
#include "stm32f4xx_hal.h"



/* Private defines -----------------------------------------------------------*/
#define LTDC_TIMEOUT                5000    /*!< Timeout for LTDC operations */
#define LTDC_MIN_ALPHA              0       /*!< Minimum alpha value */
#define LTDC_MAX_ALPHA              255     /*!< Maximum alpha value */
#define LTDC_DEFAULT_BRIGHTNESS     100     /*!< Default brightness percentage */


LTDC_HandleTypeDef hltdc;                   /*!< LTDC HAL handle */



/* Private function prototypes -----------------------------------------------*/
static HAL_StatusTypeDef LTDC_ValidateDriver(LTDC_Driver_t *driver);
static HAL_StatusTypeDef LTDC_ValidateLayer(uint8_t layer);
static HAL_StatusTypeDef LTDC_ValidateCoordinates(uint16_t xCoord, uint16_t yCoord);
static HAL_StatusTypeDef LTDC_ValidateRect(LTDC_Rect_t *rect);
static uint32_t LTDC_GetPixelFormatHAL(LTDC_PixelFormat_t format);

/* Global instance used for forwarding HAL callbacks to driver-level state */
static LTDC_Driver_t *g_ltdc_driver = NULL;

/* Minimal helper: set a pixel by index in framebuffer (row-major) */
static void LTDC_SetPixelByIndex(uint8_t *fbBase, uint32_t index, uint32_t color, LTDC_PixelFormat_t format);


/* Public Functions ----------------------------------------------------------*/

/**
 * @brief Initialize LTDC driver
 * @param driver: Pointer to LTDC driver structure
 * @param hltdc: Pointer to HAL LTDC handle
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_Driver_Init(LTDC_Driver_t *driver, LTDC_HandleTypeDef *hltdc_handle) {
    if (driver == NULL || hltdc_handle == NULL) {
        return HAL_ERROR;
    }

    /* Initialize driver structure */
    memset(driver, 0, sizeof(LTDC_Driver_t));
    driver->hltdc = hltdc_handle;
    driver->errorCode = LTDC_ERROR_NONE;
    driver->reloadFlag = 0;

    /* Register global instance for HAL callbacks (single-LTDC system assumption) */
    g_ltdc_driver = driver;

    /* Set default display configuration */
    driver->displayConfig.width = LTDC_DISPLAY_WIDTH;
    driver->displayConfig.height = LTDC_DISPLAY_HEIGHT;
    driver->displayConfig.backgroundColor = LTDC_COLOR_BLACK;
    driver->displayConfig.hsyncActiveLow = true;
    driver->displayConfig.vsyncActiveLow = true;
    /* Panel uses DE active LOW according to CubeMX / panel datasheet */
    driver->displayConfig.dataEnableActiveLow = true;
    /* Pixel clock: normal input (not inverted) */
    driver->displayConfig.pixelClockInverted = false;

    /* Initialize layer configurations */
    for (uint8_t i = 0; i < LTDC_MAX_LAYERS; i++) {
        driver->layers[i].windowX0 = 0;
        driver->layers[i].windowY0 = 0;
        /* WindowX1/Y1 are inclusive end coordinates: use width-1/height-1 */
        driver->layers[i].windowX1 = LTDC_DISPLAY_WIDTH - 1;
        driver->layers[i].windowY1 = LTDC_DISPLAY_HEIGHT - 1;
        driver->layers[i].imageWidth = LTDC_DISPLAY_WIDTH;
        driver->layers[i].imageHeight = LTDC_DISPLAY_HEIGHT;
        driver->layers[i].pixelFormat = LTDC_PIXEL_FORMAT_RGB565_ENUM;
        driver->layers[i].alpha = LTDC_MAX_ALPHA;
        driver->layers[i].alpha0 = 0;
        driver->layers[i].blendMode = LTDC_BLEND_CONSTANT_ALPHA;
        driver->layers[i].backgroundColor = LTDC_COLOR_BLACK;
        driver->layers[i].enabled = false;
        driver->layers[i].framebufferAddress = 0;
    }

    driver->activeLayer = 0;
    driver->initialized = true;

    return HAL_OK;
}

/**
 * @brief Deinitialize LTDC driver
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_Driver_DeInit(LTDC_Driver_t *driver) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) {
        return HAL_ERROR;
    }

    /* Disable all layers */
    for (uint8_t i = 0; i < LTDC_MAX_LAYERS; i++) {
        LTDC_DisableLayer(driver, i);
    }

    /* Deinitialize HAL LTDC */
    HAL_StatusTypeDef status = HAL_LTDC_DeInit(driver->hltdc);

    /* Reset driver structure */
    driver->initialized = false;
    driver->errorCode = LTDC_ERROR_NONE;

    /* Clear global instance */
    if (g_ltdc_driver == driver) {
        g_ltdc_driver = NULL;
    }

    return status;
}

/**
 * @brief Configure display parameters
 * @param driver: Pointer to LTDC driver structure
 * @param config: Pointer to display configuration
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_ConfigureDisplay(LTDC_Driver_t *driver, LTDC_DisplayConfig_t *config) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || config == NULL) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Configure LTDC timing parameters */
    driver->hltdc->Instance = LTDC;

    /* Set signal polarities from provided config (must match panel datasheet) */
    driver->hltdc->Init.HSPolarity = config->hsyncActiveLow ? LTDC_HSPOLARITY_AL : LTDC_HSPOLARITY_AH;
    driver->hltdc->Init.VSPolarity = config->vsyncActiveLow ? LTDC_VSPOLARITY_AL : LTDC_VSPOLARITY_AH;
    driver->hltdc->Init.DEPolarity  = config->dataEnableActiveLow ? LTDC_DEPOLARITY_AL : LTDC_DEPOLARITY_AH;
    driver->hltdc->Init.PCPolarity  = config->pixelClockInverted ? LTDC_PCPOLARITY_IIPC : LTDC_PCPOLARITY_IPC;

    // Set timing parameters for STM32F429I-DISC1 onboard LCD (ILI9341)
    driver->hltdc->Init.HorizontalSync = LTDC_HSYNC_WIDTH - 1;
    driver->hltdc->Init.VerticalSync = LTDC_VSYNC_HEIGHT - 1;
    driver->hltdc->Init.AccumulatedHBP = LTDC_HSYNC_WIDTH + LTDC_HBP_WIDTH - 1;
    driver->hltdc->Init.AccumulatedVBP = LTDC_VSYNC_HEIGHT + LTDC_VBP_HEIGHT - 1;
    driver->hltdc->Init.AccumulatedActiveW = LTDC_HSYNC_WIDTH + LTDC_HBP_WIDTH + config->width - 1;
    driver->hltdc->Init.AccumulatedActiveH = LTDC_VSYNC_HEIGHT + LTDC_VBP_HEIGHT + config->height - 1;
    driver->hltdc->Init.TotalWidth = LTDC_HSYNC_WIDTH + LTDC_HBP_WIDTH + config->width + LTDC_HFP_WIDTH - 1;
    driver->hltdc->Init.TotalHeigh = LTDC_VSYNC_HEIGHT + LTDC_VBP_HEIGHT + config->height + LTDC_VFP_HEIGHT - 1;

    /* Set background color */
    driver->hltdc->Init.Backcolor.Blue = (config->backgroundColor) & 0xFF;
    driver->hltdc->Init.Backcolor.Green = (config->backgroundColor >> 8) & 0xFF;
    driver->hltdc->Init.Backcolor.Red = (config->backgroundColor >> 16) & 0xFF;

    /* Initialize LTDC */
    HAL_StatusTypeDef status = HAL_LTDC_Init(driver->hltdc);
    if (status != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INIT_FAILED;
        return status;
    }

    /* Store configuration */
    driver->displayConfig = *config;

    return HAL_OK;
}

/**
 * @brief Configure layer parameters
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param config: Pointer to layer configuration
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_ConfigureLayer(LTDC_Driver_t *driver, uint8_t layer, LTDC_LayerConfig_t *config) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK || config == NULL) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    LTDC_LayerCfgTypeDef layerCfg = {0};

    /* Configure layer parameters */
    layerCfg.WindowX0 = config->windowX0;
    layerCfg.WindowX1 = config->windowX1;
    layerCfg.WindowY0 = config->windowY0;
    layerCfg.WindowY1 = config->windowY1;
    layerCfg.PixelFormat = LTDC_GetPixelFormatHAL(config->pixelFormat);
    layerCfg.Alpha = config->alpha;
    layerCfg.Alpha0 = config->alpha0;

