Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LTDC/ltdc.c
    /* Set blending factors based on blend mode */
    switch (config->blendMode) {
        case LTDC_BLEND_CONSTANT_ALPHA:
            layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
            layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
            break;
        case LTDC_BLEND_PIXEL_ALPHA:
            layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
            layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
            break;
        case LTDC_BLEND_NO_BLENDING:
        default:
            layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
            layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
            break;
    }

    layerCfg.FBStartAdress = config->framebufferAddress;
    layerCfg.ImageWidth = config->imageWidth;
    layerCfg.ImageHeight = config->imageHeight;

    /* Set background color */
    layerCfg.Backcolor.Blue = (config->backgroundColor) & 0xFF;
    layerCfg.Backcolor.Green = (config->backgroundColor >> 8) & 0xFF;
    layerCfg.Backcolor.Red = (config->backgroundColor >> 16) & 0xFF;

    /* Configure HAL layer */
    HAL_StatusTypeDef status = HAL_LTDC_ConfigLayer(driver->hltdc, &layerCfg, layer);
    if (status != HAL_OK) {
        driver->errorCode = LTDC_ERROR_LAYER_CONFIG;
        return status;
    }

    /* Store configuration */
    driver->layers[layer] = *config;

    return HAL_OK;
}

/**
 * @brief Enable layer
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_EnableLayer(LTDC_Driver_t *driver, uint8_t layer) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Enable layer */
    __HAL_LTDC_LAYER_ENABLE(driver->hltdc, layer);
    __HAL_LTDC_RELOAD_CONFIG(driver->hltdc);

    driver->layers[layer].enabled = true;
    return HAL_OK;
}

/**
 * @brief Disable layer
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_DisableLayer(LTDC_Driver_t *driver, uint8_t layer) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Disable layer */
    __HAL_LTDC_LAYER_DISABLE(driver->hltdc, layer);
    __HAL_LTDC_RELOAD_CONFIG(driver->hltdc);

    driver->layers[layer].enabled = false;
    return HAL_OK;
}

/**
 * @brief Set active layer for drawing operations
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetActiveLayer(LTDC_Driver_t *driver, uint8_t layer) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    driver->activeLayer = layer;
    return HAL_OK;
}

/**
 * @brief Set layer alpha (transparency)
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param alpha: Alpha value (0-255)
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetLayerAlpha(LTDC_Driver_t *driver, uint8_t layer, uint8_t alpha) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Set layer alpha */
    HAL_StatusTypeDef status = HAL_LTDC_SetAlpha(driver->hltdc, alpha, layer);
    if (status == HAL_OK) {
        driver->layers[layer].alpha = alpha;
    }

    return status;
}

/**
 * @brief Set layer position
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param x: X position
 * @param y: Y position
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetLayerPosition(LTDC_Driver_t *driver, uint8_t layer, uint16_t x, uint16_t y) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    if (x >= LTDC_DISPLAY_WIDTH || y >= LTDC_DISPLAY_HEIGHT) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Calculate width/height (inclusive coordinates stored in windowX1/windowY1) */
    uint16_t width = (driver->layers[layer].windowX1 - driver->layers[layer].windowX0) + 1;
    uint16_t height = (driver->layers[layer].windowY1 - driver->layers[layer].windowY0) + 1;

    /* Use HAL helper to set window position without immediate reload and then force a reload */
    HAL_StatusTypeDef status = HAL_LTDC_SetWindowPosition_NoReload(driver->hltdc, x, y, layer);
    if (status != HAL_OK) {
        driver->errorCode = LTDC_ERROR_LAYER_CONFIG;
        return status;
    }

    /* Update the cached geometry (applied after reload) */
    driver->layers[layer].windowX0 = x;
    driver->layers[layer].windowY0 = y;
    driver->layers[layer].windowX1 = x + width - 1;
    driver->layers[layer].windowY1 = y + height - 1;

    /* Request reload at next VSync */
    LTDC_RequestReload(driver, LTDC_SRCR_VBR);

    return HAL_OK;
}

/**
 * @brief Set layer window
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param window: Pointer to window rectangle
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetLayerWindow(LTDC_Driver_t *driver, uint8_t layer, LTDC_Rect_t *window) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK ||
        LTDC_ValidateRect(window) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Build layer config and apply */
    LTDC_LayerCfgTypeDef layerCfg = {0};
    layerCfg.WindowX0 = window->x;
    layerCfg.WindowX1 = window->x + window->width - 1; /* inclusive */
    layerCfg.WindowY0 = window->y;
    layerCfg.WindowY1 = window->y + window->height - 1; /* inclusive */
    layerCfg.PixelFormat = LTDC_GetPixelFormatHAL(driver->layers[layer].pixelFormat);
    layerCfg.Alpha = driver->layers[layer].alpha;
    layerCfg.Alpha0 = driver->layers[layer].alpha0;

