Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LTDC/ltdc.c
    switch (driver->layers[layer].blendMode) {
        case LTDC_BLEND_CONSTANT_ALPHA:
            layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
            layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
            break;
        case LTDC_BLEND_PIXEL_ALPHA:
            layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
            layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
            break;
        default:
            layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
            layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
            break;
    }

    layerCfg.FBStartAdress = driver->layers[layer].framebufferAddress;
    layerCfg.ImageWidth = window->width;
    layerCfg.ImageHeight = window->height;

    layerCfg.Backcolor.Blue = (driver->layers[layer].backgroundColor) & 0xFF;
    layerCfg.Backcolor.Green = (driver->layers[layer].backgroundColor >> 8) & 0xFF;
    layerCfg.Backcolor.Red = (driver->layers[layer].backgroundColor >> 16) & 0xFF;

    HAL_StatusTypeDef status = HAL_LTDC_ConfigLayer(driver->hltdc, &layerCfg, layer);
    if (status == HAL_OK) {
        driver->layers[layer].windowX0 = layerCfg.WindowX0;
        driver->layers[layer].windowY0 = layerCfg.WindowY0;
        driver->layers[layer].windowX1 = layerCfg.WindowX1;
        driver->layers[layer].windowY1 = layerCfg.WindowY1;
        driver->layers[layer].imageWidth = layerCfg.ImageWidth;
        driver->layers[layer].imageHeight = layerCfg.ImageHeight;
    } else {
        driver->errorCode = LTDC_ERROR_LAYER_CONFIG;
    }

    return status;
}

/**
 * @brief Set framebuffer address for layer
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param address: Framebuffer start address
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetFramebuffer(LTDC_Driver_t *driver, uint8_t layer, uint32_t address) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK || address == 0) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Set framebuffer address (HAL will stage the change) */
    HAL_StatusTypeDef status = HAL_LTDC_SetAddress(driver->hltdc, address, layer);
    if (status == HAL_OK) {
        /* Request register reload during next vertical blanking to avoid tearing */
        LTDC_RequestReload(driver, LTDC_SRCR_VBR);

        /* Wait for reload flag (using driver-level reload flag) */
        if (LTDC_WaitForReload(driver, LTDC_TIMEOUT) != HAL_OK) {
            driver->errorCode = LTDC_ERROR_FRAMEBUFFER;
            return HAL_TIMEOUT;
        }

        driver->layers[layer].framebufferAddress = address;
    }

    return status;
}

/**
 * @brief Swap framebuffer safely at next VSYNC
 * @param driver: Pointer to LTDC driver
 * @param layer: Layer index
 * @param address: New framebuffer address
 * @return HAL_StatusTypeDef
 */
HAL_StatusTypeDef LTDC_SwapFramebufferAtVSync(LTDC_Driver_t *driver, uint8_t layer, uint32_t address) {
    return LTDC_SetFramebuffer(driver, layer, address);
}

/**
 * @brief Clear framebuffer with specified color
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param color: Clear color
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_ClearFramebuffer(LTDC_Driver_t *driver, uint8_t layer, uint32_t color) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    if (driver->layers[layer].framebufferAddress == 0) {
        driver->errorCode = LTDC_ERROR_FRAMEBUFFER;
        return HAL_ERROR;
    }

    /* After clearing the backbuffer, request reload so the displayed buffer updates at VSYNC */
    HAL_StatusTypeDef status = HAL_OK;
    /* Perform clearing */

    uint32_t *framebuffer = (uint32_t *)driver->layers[layer].framebufferAddress;
    uint32_t pixelCount = driver->layers[layer].imageWidth * driver->layers[layer].imageHeight;

    /* Clear framebuffer based on pixel format */
    switch (driver->layers[layer].pixelFormat) {
        case LTDC_PIXEL_FORMAT_RGB565_ENUM:
            {
                uint16_t *fb16 = (uint16_t *)framebuffer;
                uint16_t color16 = (uint16_t)color;
                for (uint32_t i = 0; i < pixelCount; i++) {
                    fb16[i] = color16;
                }
            }
            break;

        case LTDC_PIXEL_FORMAT_RGB888_ENUM:
            {
                uint8_t *fb8 = (uint8_t *)framebuffer;
                for (uint32_t i = 0; i < pixelCount; i++) {
                    fb8[i * 3] = (color) & 0xFF;        /* Blue */
                    fb8[i * 3 + 1] = (color >> 8) & 0xFF;  /* Green */
                    fb8[i * 3 + 2] = (color >> 16) & 0xFF; /* Red */
                }
            }
            break;

        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM:
        default:
            for (uint32_t i = 0; i < pixelCount; i++) {
                framebuffer[i] = color;
            }
            break;
    }

    /* Request reload to apply buffer changes if using swap at VSYNC */
    LTDC_RequestReload(driver, LTDC_SRCR_VBR);

    return status;
}

/**
 * @brief Fill framebuffer with specified color
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number (0 or 1)
 * @param color: Fill color
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_FillFramebuffer(LTDC_Driver_t *driver, uint8_t layer, uint32_t color) {
    return LTDC_ClearFramebuffer(driver, layer, color);
}

/**
 * @brief Copy framebuffer from source to destination layer
 * @param driver: Pointer to LTDC driver structure
 * @param srcLayer: Source layer number
 * @param dstLayer: Destination layer number
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_CopyFramebuffer(LTDC_Driver_t *driver, uint8_t srcLayer, uint8_t dstLayer) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(srcLayer) != HAL_OK ||
        LTDC_ValidateLayer(dstLayer) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

