Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LTDC/ltdc.c
    return (r << 16) | (g << 8) | b;
}

/**
 * @brief Convert ARGB8888 to RGB565
 * @param argb8888: 32-bit ARGB color
 * @return uint32_t: 16-bit RGB565 color
 */
uint32_t LTDC_ARGB8888_To_RGB565(uint32_t argb8888) {
    return LTDC_RGB888_To_RGB565(argb8888 & 0x00FFFFFF);
}

/**
 * @brief Get layer information
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number
 * @param info: Pointer to layer info structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_GetLayerInfo(LTDC_Driver_t *driver, uint8_t layer, LTDC_LayerConfig_t *info) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK || info == NULL) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    *info = driver->layers[layer];
    return HAL_OK;
}

/**
 * @brief  Request a register reload (e.g., LTDC_SRCR_VBR) to apply staged changes at VSYNC
 */
HAL_StatusTypeDef LTDC_RequestReload(LTDC_Driver_t *driver, uint32_t reload) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) return HAL_ERROR;

    /* Clear previous flag and request reload */
    driver->reloadFlag = 0;
    HAL_LTDC_Reload(driver->hltdc, reload);
    return HAL_OK;
}

/**
 * @brief Wait for reload event (VSYNC) - interrupt-driven
 * This implementation uses ARM WFE/SEV to wait efficiently for the HAL reload
 * event callback to set the driver's reloadFlag and wake this task.
 */
HAL_StatusTypeDef LTDC_WaitForReload(LTDC_Driver_t *driver, uint32_t timeout_ms) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) return HAL_ERROR;
    uint32_t start = HAL_GetTick();
    /* Wait efficiently using WFE (wait for event). The HAL_LTDC_ReloadEventCallback
       will set reloadFlag and call __SEV() to wake up this waiter. */
    while (driver->reloadFlag == 0) {
        if (HAL_GetTick() - start > timeout_ms) return HAL_TIMEOUT;
        __WFE(); /* low-power wait until an event occurs */
    }
    driver->reloadFlag = 0;
    return HAL_OK;
}

/**
 * @brief Set window position without triggering a reload immediately
 */
HAL_StatusTypeDef LTDC_SetWindowPosition_NoReload(LTDC_Driver_t *driver, uint16_t x, uint16_t y, uint8_t layer) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK) return HAL_ERROR;
    if (x >= LTDC_DISPLAY_WIDTH || y >= LTDC_DISPLAY_HEIGHT) return HAL_ERROR;

    /* Use HAL's NoReload API and update cached window origin to be applied after reload */
    HAL_StatusTypeDef status = HAL_LTDC_SetWindowPosition_NoReload(driver->hltdc, x, y, layer);
    if (status == HAL_OK) {
        /* Update cache - x/y origin; end coordinates kept consistent with width/height */
        uint16_t width = (driver->layers[layer].windowX1 - driver->layers[layer].windowX0) + 1;
        uint16_t height = (driver->layers[layer].windowY1 - driver->layers[layer].windowY0) + 1;
        driver->layers[layer].windowX0 = x;
        driver->layers[layer].windowY0 = y;
        driver->layers[layer].windowX1 = x + width - 1;
        driver->layers[layer].windowY1 = y + height - 1;
    }
    return status;
}

/**
 * @brief Check if layer is enabled
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number
 * @return bool: true if enabled, false otherwise
 */
bool LTDC_IsLayerEnabled(LTDC_Driver_t *driver, uint8_t layer) {
    if (driver == NULL || layer >= LTDC_MAX_LAYERS) {
        return false;
    }
    return driver->layers[layer].enabled;
}

/**
 * @brief Get last error code
 * @param driver: Pointer to LTDC driver structure
 * @return uint32_t: Error code
 */
uint32_t LTDC_GetError(LTDC_Driver_t *driver) {
    if (driver == NULL) {
        return LTDC_ERROR_INVALID_PARAM;
    }
    return driver->errorCode;
}

/**
 * @brief Clear error code
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_ClearError(LTDC_Driver_t *driver) {
    if (driver == NULL) {
        return HAL_ERROR;
    }
    driver->errorCode = LTDC_ERROR_NONE;
    return HAL_OK;
}



/**
 * @brief Hardware initialization
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_HW_Init(void) {

    /* Initialize LTDC Peripheral (RGB interface only) */

    /* Enable LTDC clock */
    __HAL_RCC_LTDC_CLK_ENABLE();

    /* Configure LTDC peripheral */
    hltdc.Instance = LTDC;

    /* Signal polarities - MUST MATCH ILI9341 RGB interface settings! */
    hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;   // HSYNC active low
    hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;   // VSYNC active low
    hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;   // DE active low (per STM32F429I-DISCO BSP)
    hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;  // Pixel clock not inverted (input pixel clock)


    /* Timing parameters for STM32F429I-DISC1 LCD (RGB interface)
     * Matches ST BSP values: HSYNC=10, HBP=20, HFP=10, VSYNC=2, VBP=2, VFP=4, active=240x320.
     */
    hltdc.Init.HorizontalSync = 9;   // HSYNC width - 1 (10)
    hltdc.Init.VerticalSync = 1;     // VSYNC height - 1 (2)
    hltdc.Init.AccumulatedHBP = 29;  // HSYNC + HBP - 1 (10+20-1)
    hltdc.Init.AccumulatedVBP = 3;   // VSYNC + VBP - 1 (2+2-1)
    hltdc.Init.AccumulatedActiveW = 269;  // HSYNC + HBP + Width - 1 (10+20+240-1)
    hltdc.Init.AccumulatedActiveH = 323;  // VSYNC + VBP + Height - 1 (2+2+320-1)
    hltdc.Init.TotalWidth = 279;     // Total horizontal - 1 (add HFP=10)
    hltdc.Init.TotalHeigh = 327;     // Total vertical - 1 (add VFP=4)

    /* Background color (black) */
    hltdc.Init.Backcolor.Blue = 0;
    hltdc.Init.Backcolor.Green = 0;
    hltdc.Init.Backcolor.Red = 0;

    /* Initialize LTDC */
    if (HAL_LTDC_Init(&hltdc) != HAL_OK) {
        return HAL_ERROR;
    }

    /* Configure Layer 1 */
    LTDC_LayerCfgTypeDef layerCfg = {0};
    layerCfg.WindowX0 = 0;
    layerCfg.WindowX1 = 240;  // Use BSP convention: stop coordinate is end+1
    layerCfg.WindowY0 = 0;
    layerCfg.WindowY1 = 320;  // BSP convention: stop coordinate is end+1
    layerCfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
    layerCfg.Alpha = 255;
    layerCfg.Alpha0 = 0;
    layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
    layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
    layerCfg.FBStartAdress = 0xD0000000;  // SDRAM framebuffer
    layerCfg.ImageWidth = 240;
    layerCfg.ImageHeight = 320;
    layerCfg.Backcolor.Blue = 0;
    layerCfg.Backcolor.Green = 0;
    layerCfg.Backcolor.Red = 0;

    if (HAL_LTDC_ConfigLayer(&hltdc, &layerCfg, 0) != HAL_OK) {
        return HAL_ERROR;
    }

    /* Enable Layer 1 */
    __HAL_LTDC_LAYER_ENABLE(&hltdc, 0);
    __HAL_LTDC_RELOAD_CONFIG(&hltdc);  // Reload at VSYNC

    return HAL_OK;
}

/**
 * @brief Initialize LTDC MSP (wrapper for HAL_LTDC_MspInit)
 * @param hltdc: Pointer to LTDC handle
 */
void LTDC_MspInit(LTDC_HandleTypeDef *hltdc) {
    HAL_LTDC_MspInit(hltdc);
}

/**
 * @brief De-initialize LTDC MSP (wrapper for HAL_LTDC_MspDeInit)
 * @param hltdc: Pointer to LTDC handle
 */
void LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc) {
    HAL_LTDC_MspDeInit(hltdc);
}

/* HAL reload event callback - forward to driver instance if available */
void HAL_LTDC_ReloadEventCallback(LTDC_HandleTypeDef *hltdc) {
    (void)hltdc;
    if (g_ltdc_driver != NULL) {
        g_ltdc_driver->reloadFlag = 1;
        /* Wake any waiter blocked in __WFE() */
        __SEV();
    }
}

/* Private Functions ---------------------------------------------------------*/

/**
 * @brief Validate driver handle
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateDriver(LTDC_Driver_t *driver) {
    if (driver == NULL || !driver->initialized || driver->hltdc == NULL) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Validate layer number
 * @param layer: Layer number
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateLayer(uint8_t layer) {
    if (layer >= LTDC_MAX_LAYERS) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Validate coordinates
 * @param x: X coordinate
 * @param y: Y coordinate
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateCoordinates(uint16_t x, uint16_t y) {
    if (x >= LTDC_DISPLAY_WIDTH || y >= LTDC_DISPLAY_HEIGHT) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Validate rectangle
 * @param rect: Pointer to rectangle structure
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateRect(LTDC_Rect_t *rect) {
    if (rect == NULL ||
        rect->x >= LTDC_DISPLAY_WIDTH ||
        rect->y >= LTDC_DISPLAY_HEIGHT ||
        (rect->x + rect->width) > LTDC_DISPLAY_WIDTH ||
        (rect->y + rect->height) > LTDC_DISPLAY_HEIGHT) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Get HAL pixel format from driver format
 * @param format: Driver pixel format
 * @return uint32_t: HAL pixel format
 */
static uint32_t LTDC_GetPixelFormatHAL(LTDC_PixelFormat_t format) {
    switch (format) {
        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM: return LTDC_PIXEL_FORMAT_ARGB8888;
        case LTDC_PIXEL_FORMAT_RGB888_ENUM: return LTDC_PIXEL_FORMAT_RGB888;
        case LTDC_PIXEL_FORMAT_RGB565_ENUM: return LTDC_PIXEL_FORMAT_RGB565;
        case LTDC_PIXEL_FORMAT_ARGB1555_ENUM: return LTDC_PIXEL_FORMAT_ARGB1555;
        case LTDC_PIXEL_FORMAT_ARGB4444_ENUM: return LTDC_PIXEL_FORMAT_ARGB4444;
        case LTDC_PIXEL_FORMAT_L8_ENUM: return LTDC_PIXEL_FORMAT_L8;
        case LTDC_PIXEL_FORMAT_AL44_ENUM: return LTDC_PIXEL_FORMAT_AL44;
        case LTDC_PIXEL_FORMAT_AL88_ENUM: return LTDC_PIXEL_FORMAT_AL88;
        default: return LTDC_PIXEL_FORMAT_ARGB8888;
    }
}

/**
 * @brief Get driver pixel format from HAL format
 * @param halFormat: HAL pixel format
 * @return LTDC_PixelFormat_t: Driver pixel format
 */


/* New helper: set pixel by linear index (row-major) where framebuffer base is a byte pointer */
static void LTDC_SetPixelByIndex(uint8_t *fbBase, uint32_t index, uint32_t color, LTDC_PixelFormat_t format) {
    switch (format) {
        case LTDC_PIXEL_FORMAT_RGB565_ENUM: {
            uint16_t *fb16 = (uint16_t *)fbBase;
            fb16[index] = (uint16_t)color;
            break;
        }
        case LTDC_PIXEL_FORMAT_RGB888_ENUM: {
            uint8_t *p = fbBase + index * 3;
            p[0] = (color) & 0xFF;        /* Blue */
            p[1] = (color >> 8) & 0xFF;  /* Green */
            p[2] = (color >> 16) & 0xFF; /* Red */
            break;
        }
        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM:
        default: {
            uint32_t *fb32 = (uint32_t *)fbBase;
            fb32[index] = color;
            break;
        }
    }
}

